pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6007.h
/* SAPHASQTRIG Control Bits */
#define ASQTRIG                          (0x0001)        /* */
#define ASQTRIG_L                        (0x0001)

/* SAPHAPOL Control Bits */
#define PCPOL                            (0x000f)        /* */
#define PCPOL_L                          (0x000f)
#define PCPOL0                           (0x0001)        /* */
#define PCPOL0_L                         (0x0001)
#define PCPOL1                           (0x0002)        /* */
#define PCPOL1_L                         (0x0002)
#define PCPOL2                           (0x0004)        /* */
#define PCPOL2_L                         (0x0004)
#define PCPOL3                           (0x0008)        /* */
#define PCPOL3_L                         (0x0008)

/* SAPHAPLEV Control Bits */
#define PCPLEV                           (0x000f)        /* */
#define PCPLEV_L                         (0x000f)
#define PCPLEV0                          (0x0001)        /* */
#define PCPLEV0_L                        (0x0001)
#define PCPLEV1                          (0x0002)        /* */
#define PCPLEV1_L                        (0x0002)
#define PCPLEV2                          (0x0004)        /* */
#define PCPLEV2_L                        (0x0004)
#define PCPLEV3                          (0x0008)        /* */
#define PCPLEV3_L                        (0x0008)

/* SAPHAPHIZ Control Bits */
#define PCPHIZ                           (0x000f)        /* */
#define PCPHIZ_L                         (0x000f)
#define PCPHIZ0                          (0x0001)        /* */
#define PCPHIZ0_L                        (0x0001)
#define PCPHIZ1                          (0x0002)        /* */
#define PCPHIZ1_L                        (0x0002)
#define PCPHIZ2                          (0x0004)        /* */
#define PCPHIZ2_L                        (0x0004)
#define PCPHIZ3                          (0x0008)        /* */
#define PCPHIZ3_L                        (0x0008)

/* SAPHATM_A Control Bits */
#define TIMEMARK_A                       (0xffff)        /* */
#define TIMEMARK_A_L                     (0x00ff)
#define TIMEMARK_A_H                     (0x00ff)
#define TIMEMARK_A0                      (0x0001)        /* */
#define TIMEMARK_A0_L                    (0x0001)
#define TIMEMARK_A1                      (0x0002)        /* */
#define TIMEMARK_A1_L                    (0x0002)
#define TIMEMARK_A2                      (0x0004)        /* */
#define TIMEMARK_A2_L                    (0x0004)
#define TIMEMARK_A3                      (0x0008)        /* */
#define TIMEMARK_A3_L                    (0x0008)
#define TIMEMARK_A4                      (0x0010)        /* */
#define TIMEMARK_A4_L                    (0x0010)
#define TIMEMARK_A5                      (0x0020)        /* */
#define TIMEMARK_A5_L                    (0x0020)
#define TIMEMARK_A6                      (0x0040)        /* */
#define TIMEMARK_A6_L                    (0x0040)
#define TIMEMARK_A7                      (0x0080)        /* */
#define TIMEMARK_A7_L                    (0x0080)
#define TIMEMARK_A8                      (0x0100)        /* */
#define TIMEMARK_A8_H                    (0x0001)
#define TIMEMARK_A9                      (0x0200)        /* */
#define TIMEMARK_A9_H                    (0x0002)
#define TIMEMARK_A10                     (0x0400)        /* */
#define TIMEMARK_A10_H                   (0x0004)
#define TIMEMARK_A11                     (0x0800)        /* */
#define TIMEMARK_A11_H                   (0x0008)
#define TIMEMARK_A12                     (0x1000)        /* */
#define TIMEMARK_A12_H                   (0x0010)
#define TIMEMARK_A13                     (0x2000)        /* */
#define TIMEMARK_A13_H                   (0x0020)
#define TIMEMARK_A14                     (0x4000)        /* */
#define TIMEMARK_A14_H                   (0x0040)
#define TIMEMARK_A15                     (0x8000)        /* */
#define TIMEMARK_A15_H                   (0x0080)

/* SAPHATM_B Control Bits */
#define TIMEMARK_B                       (0xffff)        /* */
#define TIMEMARK_B_L                     (0x00ff)
#define TIMEMARK_B_H                     (0x00ff)
#define TIMEMARK_B0                      (0x0001)        /* */
#define TIMEMARK_B0_L                    (0x0001)
#define TIMEMARK_B1                      (0x0002)        /* */
#define TIMEMARK_B1_L                    (0x0002)
#define TIMEMARK_B2                      (0x0004)        /* */
#define TIMEMARK_B2_L                    (0x0004)
#define TIMEMARK_B3                      (0x0008)        /* */
#define TIMEMARK_B3_L                    (0x0008)
#define TIMEMARK_B4                      (0x0010)        /* */
#define TIMEMARK_B4_L                    (0x0010)
#define TIMEMARK_B5                      (0x0020)        /* */
#define TIMEMARK_B5_L                    (0x0020)
#define TIMEMARK_B6                      (0x0040)        /* */
#define TIMEMARK_B6_L                    (0x0040)
#define TIMEMARK_B7                      (0x0080)        /* */
#define TIMEMARK_B7_L                    (0x0080)
#define TIMEMARK_B8                      (0x0100)        /* */
#define TIMEMARK_B8_H                    (0x0001)
#define TIMEMARK_B9                      (0x0200)        /* */
#define TIMEMARK_B9_H                    (0x0002)
#define TIMEMARK_B10                     (0x0400)        /* */
#define TIMEMARK_B10_H                   (0x0004)
#define TIMEMARK_B11                     (0x0800)        /* */
#define TIMEMARK_B11_H                   (0x0008)
#define TIMEMARK_B12                     (0x1000)        /* */
#define TIMEMARK_B12_H                   (0x0010)
#define TIMEMARK_B13                     (0x2000)        /* */
#define TIMEMARK_B13_H                   (0x0020)
#define TIMEMARK_B14                     (0x4000)        /* */
#define TIMEMARK_B14_H                   (0x0040)
#define TIMEMARK_B15                     (0x8000)        /* */
#define TIMEMARK_B15_H                   (0x0080)

/* SAPHATM_C Control Bits */
#define TIMEMARK_C                       (0xffff)        /* */
#define TIMEMARK_C_L                     (0x00ff)
#define TIMEMARK_C_H                     (0x00ff)
#define TIMEMARK_C0                      (0x0001)        /* */
#define TIMEMARK_C0_L                    (0x0001)
#define TIMEMARK_C1                      (0x0002)        /* */
#define TIMEMARK_C1_L                    (0x0002)
#define TIMEMARK_C2                      (0x0004)        /* */
#define TIMEMARK_C2_L                    (0x0004)
#define TIMEMARK_C3                      (0x0008)        /* */
#define TIMEMARK_C3_L                    (0x0008)
#define TIMEMARK_C4                      (0x0010)        /* */
#define TIMEMARK_C4_L                    (0x0010)
#define TIMEMARK_C5                      (0x0020)        /* */
#define TIMEMARK_C5_L                    (0x0020)
#define TIMEMARK_C6                      (0x0040)        /* */
#define TIMEMARK_C6_L                    (0x0040)
#define TIMEMARK_C7                      (0x0080)        /* */
#define TIMEMARK_C7_L                    (0x0080)
#define TIMEMARK_C8                      (0x0100)        /* */
#define TIMEMARK_C8_H                    (0x0001)
#define TIMEMARK_C9                      (0x0200)        /* */
#define TIMEMARK_C9_H                    (0x0002)
#define TIMEMARK_C10                     (0x0400)        /* */
#define TIMEMARK_C10_H                   (0x0004)
#define TIMEMARK_C11                     (0x0800)        /* */
#define TIMEMARK_C11_H                   (0x0008)
#define TIMEMARK_C12                     (0x1000)        /* */
#define TIMEMARK_C12_H                   (0x0010)
#define TIMEMARK_C13                     (0x2000)        /* */
#define TIMEMARK_C13_H                   (0x0020)
#define TIMEMARK_C14                     (0x4000)        /* */
#define TIMEMARK_C14_H                   (0x0040)
#define TIMEMARK_C15                     (0x8000)        /* */
#define TIMEMARK_C15_H                   (0x0080)

/* SAPHATM_D Control Bits */
#define TIMEMARK_D                       (0xffff)        /* */
#define TIMEMARK_D_L                     (0x00ff)
#define TIMEMARK_D_H                     (0x00ff)
#define TIMEMARK_D0                      (0x0001)        /* */
#define TIMEMARK_D0_L                    (0x0001)
#define TIMEMARK_D1                      (0x0002)        /* */
#define TIMEMARK_D1_L                    (0x0002)
#define TIMEMARK_D2                      (0x0004)        /* */
#define TIMEMARK_D2_L                    (0x0004)
#define TIMEMARK_D3                      (0x0008)        /* */
#define TIMEMARK_D3_L                    (0x0008)
#define TIMEMARK_D4                      (0x0010)        /* */
#define TIMEMARK_D4_L                    (0x0010)
#define TIMEMARK_D5                      (0x0020)        /* */
#define TIMEMARK_D5_L                    (0x0020)
#define TIMEMARK_D6                      (0x0040)        /* */
#define TIMEMARK_D6_L                    (0x0040)
#define TIMEMARK_D7                      (0x0080)        /* */
#define TIMEMARK_D7_L                    (0x0080)
#define TIMEMARK_D8                      (0x0100)        /* */
#define TIMEMARK_D8_H                    (0x0001)
#define TIMEMARK_D9                      (0x0200)        /* */
#define TIMEMARK_D9_H                    (0x0002)
#define TIMEMARK_D10                     (0x0400)        /* */
#define TIMEMARK_D10_H                   (0x0004)
#define TIMEMARK_D11                     (0x0800)        /* */
#define TIMEMARK_D11_H                   (0x0008)
#define TIMEMARK_D12                     (0x1000)        /* */
#define TIMEMARK_D12_H                   (0x0010)
#define TIMEMARK_D13                     (0x2000)        /* */
#define TIMEMARK_D13_H                   (0x0020)
#define TIMEMARK_D14                     (0x4000)        /* */
#define TIMEMARK_D14_H                   (0x0040)
#define TIMEMARK_D15                     (0x8000)        /* */
#define TIMEMARK_D15_H                   (0x0080)

/* SAPHATM_E Control Bits */
#define TIMEMARK_E                       (0xffff)        /* */
#define TIMEMARK_E_L                     (0x00ff)
#define TIMEMARK_E_H                     (0x00ff)
#define TIMEMARK_E0                      (0x0001)        /* */
#define TIMEMARK_E0_L                    (0x0001)
#define TIMEMARK_E1                      (0x0002)        /* */
#define TIMEMARK_E1_L                    (0x0002)
#define TIMEMARK_E2                      (0x0004)        /* */
#define TIMEMARK_E2_L                    (0x0004)
#define TIMEMARK_E3                      (0x0008)        /* */
#define TIMEMARK_E3_L                    (0x0008)
#define TIMEMARK_E4                      (0x0010)        /* */
#define TIMEMARK_E4_L                    (0x0010)
#define TIMEMARK_E5                      (0x0020)        /* */
#define TIMEMARK_E5_L                    (0x0020)
#define TIMEMARK_E6                      (0x0040)        /* */
#define TIMEMARK_E6_L                    (0x0040)
#define TIMEMARK_E7                      (0x0080)        /* */
#define TIMEMARK_E7_L                    (0x0080)
#define TIMEMARK_E8                      (0x0100)        /* */
#define TIMEMARK_E8_H                    (0x0001)
#define TIMEMARK_E9                      (0x0200)        /* */
#define TIMEMARK_E9_H                    (0x0002)
#define TIMEMARK_E10                     (0x0400)        /* */
#define TIMEMARK_E10_H                   (0x0004)
#define TIMEMARK_E11                     (0x0800)        /* */
#define TIMEMARK_E11_H                   (0x0008)
#define TIMEMARK_E12                     (0x1000)        /* */
#define TIMEMARK_E12_H                   (0x0010)
#define TIMEMARK_E13                     (0x2000)        /* */
#define TIMEMARK_E13_H                   (0x0020)
#define TIMEMARK_E14                     (0x4000)        /* */
#define TIMEMARK_E14_H                   (0x0040)
#define TIMEMARK_E15                     (0x8000)        /* */
#define TIMEMARK_E15_H                   (0x0080)

/* SAPHATM_F Control Bits */
#define TIMEMARK_F                       (0xffff)        /* */
#define TIMEMARK_F_L                     (0x00ff)
#define TIMEMARK_F_H                     (0x00ff)
#define TIMEMARK_F0                      (0x0001)        /* */
#define TIMEMARK_F0_L                    (0x0001)
#define TIMEMARK_F1                      (0x0002)        /* */
#define TIMEMARK_F1_L                    (0x0002)
#define TIMEMARK_F2                      (0x0004)        /* */
#define TIMEMARK_F2_L                    (0x0004)
#define TIMEMARK_F3                      (0x0008)        /* */
#define TIMEMARK_F3_L                    (0x0008)
#define TIMEMARK_F4                      (0x0010)        /* */
#define TIMEMARK_F4_L                    (0x0010)
#define TIMEMARK_F5                      (0x0020)        /* */
#define TIMEMARK_F5_L                    (0x0020)
#define TIMEMARK_F6                      (0x0040)        /* */
#define TIMEMARK_F6_L                    (0x0040)
#define TIMEMARK_F7                      (0x0080)        /* */
#define TIMEMARK_F7_L                    (0x0080)
#define TIMEMARK_F8                      (0x0100)        /* */
#define TIMEMARK_F8_H                    (0x0001)
#define TIMEMARK_F9                      (0x0200)        /* */
#define TIMEMARK_F9_H                    (0x0002)
#define TIMEMARK_F10                     (0x0400)        /* */
#define TIMEMARK_F10_H                   (0x0004)
#define TIMEMARK_F11                     (0x0800)        /* */
#define TIMEMARK_F11_H                   (0x0008)
#define TIMEMARK_F12                     (0x1000)        /* */
#define TIMEMARK_F12_H                   (0x0010)
#define TIMEMARK_F13                     (0x2000)        /* */
#define TIMEMARK_F13_H                   (0x0020)
#define TIMEMARK_F14                     (0x4000)        /* */
#define TIMEMARK_F14_H                   (0x0040)
#define TIMEMARK_F15                     (0x8000)        /* */
#define TIMEMARK_F15_H                   (0x0080)

/* SAPHTBCTL Control Bits */
#define TCLR                             (0x0001)        /* */
#define TCLR_L                           (0x0001)
#define TSTART                           (0x0002)        /* */
#define TSTART_L                         (0x0002)
#define TSTOP                            (0x0004)        /* */
#define TSTOP_L                          (0x0004)
#define PSSV                             (0x00f0)        /* */
#define PSSV_L                           (0x00f0)
#define PSSV0                            (0x0010)        /* */
#define PSSV0_L                          (0x0010)
#define PSSV1                            (0x0020)        /* */
#define PSSV1_L                          (0x0020)
#define PSSV2                            (0x0040)        /* */
#define PSSV2_L                          (0x0040)
#define PSSV3                            (0x0080)        /* */
#define PSSV3_L                          (0x0080)

/* SAPHATIMLO Control Bits */
#define ATIMLO                           (0xffff)        /* */
#define ATIMLO_L                         (0x00ff)
#define ATIMLO_H                         (0x00ff)
#define ATIMLO0                          (0x0001)        /* */
#define ATIMLO0_L                        (0x0001)
#define ATIMLO1                          (0x0002)        /* */
#define ATIMLO1_L                        (0x0002)
#define ATIMLO2                          (0x0004)        /* */
#define ATIMLO2_L                        (0x0004)
#define ATIMLO3                          (0x0008)        /* */
#define ATIMLO3_L                        (0x0008)
#define ATIMLO4                          (0x0010)        /* */
#define ATIMLO4_L                        (0x0010)
#define ATIMLO5                          (0x0020)        /* */
#define ATIMLO5_L                        (0x0020)
#define ATIMLO6                          (0x0040)        /* */
#define ATIMLO6_L                        (0x0040)
#define ATIMLO7                          (0x0080)        /* */
#define ATIMLO7_L                        (0x0080)
#define ATIMLO8                          (0x0100)        /* */
#define ATIMLO8_H                        (0x0001)
#define ATIMLO9                          (0x0200)        /* */
#define ATIMLO9_H                        (0x0002)
#define ATIMLO10                         (0x0400)        /* */
#define ATIMLO10_H                       (0x0004)
#define ATIMLO11                         (0x0800)        /* */
#define ATIMLO11_H                       (0x0008)
#define ATIMLO12                         (0x1000)        /* */
#define ATIMLO12_H                       (0x0010)
#define ATIMLO13                         (0x2000)        /* */
#define ATIMLO13_H                       (0x0020)
#define ATIMLO14                         (0x4000)        /* */
#define ATIMLO14_H                       (0x0040)
#define ATIMLO15                         (0x8000)        /* */
#define ATIMLO15_H                       (0x0080)

/* SAPHATIMHI Control Bits */
#define ATIMHI                           (0x000f)        /* */
#define ATIMHI_L                         (0x000f)
#define ATIMHI0                          (0x0001)        /* */
#define ATIMHI0_L                        (0x0001)
#define ATIMHI1                          (0x0002)        /* */
#define ATIMHI1_L                        (0x0002)
#define ATIMHI2                          (0x0004)        /* */
#define ATIMHI2_L                        (0x0004)
#define ATIMHI3                          (0x0008)        /* */
#define ATIMHI3_L                        (0x0008)


/*****************************************************************************
 SDHS Registers
*****************************************************************************/

#define __MSP430_HAS_SDHS__                   /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_SDHS__ 0x0E80
#define SDHS_BASE              __MSP430_BASEADDRESS_SDHS__

sfr_w(SDHSIIDX);                              /* Interrupt Index Register */
sfr_b(SDHSIIDX_L);
sfr_b(SDHSIIDX_H);
sfr_w(SDHSMIS);                               /* Masked Interrupt Status and Clear Register */
sfr_b(SDHSMIS_L);
sfr_b(SDHSMIS_H);
sfr_w(SDHSRIS);                               /* Raw Interrupt Status Register */
sfr_b(SDHSRIS_L);
sfr_b(SDHSRIS_H);
sfr_w(SDHSIMSC);                              /* Interrupt Mask Register */
sfr_b(SDHSIMSC_L);
sfr_b(SDHSIMSC_H);
sfr_w(SDHSICR);                               /* Interrupt Clear Register. */
sfr_b(SDHSICR_L);
sfr_b(SDHSICR_H);
sfr_w(SDHSISR);                               /* Interrupt Set Register. */
sfr_b(SDHSISR_L);
sfr_b(SDHSISR_H);
sfr_w(SDHSDESCLO);                            /* SDHS Descriptor Register L. */
sfr_b(SDHSDESCLO_L);
sfr_b(SDHSDESCLO_H);
sfr_w(SDHSDESCHI);                            /* SDHS Descriptor Register H. */
sfr_b(SDHSDESCHI_L);
sfr_b(SDHSDESCHI_H);
sfr_w(SDHSCTL0);                              /* SDHS Control Register 0 */
sfr_b(SDHSCTL0_L);
sfr_b(SDHSCTL0_H);
sfr_w(SDHSCTL1);                              /* SDHS Control Register 1 */
sfr_b(SDHSCTL1_L);
sfr_b(SDHSCTL1_H);
sfr_w(SDHSCTL2);                              /* SDHS Control Register 2 */
sfr_b(SDHSCTL2_L);
sfr_b(SDHSCTL2_H);
sfr_w(SDHSCTL3);                              /* SDHS Control Register 3 */
sfr_b(SDHSCTL3_L);
sfr_b(SDHSCTL3_H);
sfr_w(SDHSCTL4);                              /* SDHS Control Register 4 */
sfr_b(SDHSCTL4_L);
sfr_b(SDHSCTL4_H);
sfr_w(SDHSCTL5);                              /* SDHS Control Register 5 */
sfr_b(SDHSCTL5_L);
sfr_b(SDHSCTL5_H);
sfr_w(SDHSCTL6);                              /* SDHS Control Register 6 */
sfr_b(SDHSCTL6_L);
sfr_b(SDHSCTL6_H);
sfr_w(SDHSCTL7);                              /* SDHS Control Register 7 */
sfr_b(SDHSCTL7_L);
sfr_b(SDHSCTL7_H);
sfr_w(SDHSDT);                                /* SDHS Data Converstion Register */
sfr_b(SDHSDT_L);
sfr_b(SDHSDT_H);
sfr_w(SDHSWINHITH);                           /* SDHS Window Comparator High Threshold Register. */
sfr_b(SDHSWINHITH_L);
sfr_b(SDHSWINHITH_H);
sfr_w(SDHSWINLOTH);                           /* SDHS Window Comparator Low Threshold Register. */
sfr_b(SDHSWINLOTH_L);
sfr_b(SDHSWINLOTH_H);
sfr_w(SDHSDTCDA);                             /* DTC destination address register */
sfr_b(SDHSDTCDA_L);
sfr_b(SDHSDTCDA_H);

